Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །འགྲིབ་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe anything that decreases.

source: །ཀུན་ནས་ཉོན་མོངས་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe anything that is afflicted.

source: །རྣམ་པར་བྱང་བ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe anything that is purified.

source: །གཟུགས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe physical forms.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe feelings, perceptions, formative predispositions, or consciousness.

source: །གང་ལ་བྱང་ཆུབ་ཅེས་བྱ་བ་འམ་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བ་དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not even observe anything that is ‘enlightenment’ or a ‘bodhisattva.’

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་ཆོས་རྣམས་སོ་སོའི་མིང་སྒྱུ་མ་སྟེ།
en: If you ask why, it is because phenomena are a magical display of distinct names.

source: རྣམ་པར་བརྟགས་པ་དེ་དག་འཕྲལ་དུ་བྱུང་བའི་མིང་ཡང་ཡང་དག་པ་མ་ཡིན་པ་ལས་ཡོངས་སུ་བརྟགས་པ་ཐ་སྙད་དུ་བརྗོད་དོ།
en: Even these designations, these names that have adventitiously arisen, are not genuine, but imputations used as conventions.

source: །ཐ་སྙད་ཀྱི་རྒྱུས་མངོན་བར་ཞེན་པར་གྱུར་པས།
en: It is the conventions that are the basis of fixation.

source: དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ་དམིགས་པ་མེད་དོ།
en: For this reason, when bodhisattva great beings practice the perfection of wisdom, they do not observe any phenomena and do not apprehend anything.

source: །ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་ལ་དམིགས་པ་མེད་པས་རློམ་སེམས་མེད་དོ།
en: Since they do not observe anything and do not apprehend anything, they do not give rise to any conceits.

source: །མངོན་པར་ཞེན་པ་མེད་དོ།
en: They are without fixations. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། འདི་ལྟར་ཡོངས་སུ་རྟོག་སྟེ། འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བ་འདི་ནི་མིང་ཙམ་མོ། །འདི་ལྟ་སྟེ། བྱང་ཆུབ་ཅེས་བྱ་བ་འདི་ནི་མིང་ཙམ་མོ། །འདི་ལྟ་སྟེ། སངས་རྒྱས་ཤེས་བྱ་བ་འདི་ནི་མིང་ཙམ་མོ། །འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཞེས་བྱ་བ་འདི་ནི་མིང་ཙམ་མོ། །འདི་ལྟ་སྟེ།
en: Moreover, Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom, they determine that this ‘bodhisattva’ is a mere name.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ་ཞེས་བྱ་བ་འདི་ནི་མིང་ཙམ་མོ། །འདི་ལྟ་སྟེ། གཟུགས་ཤེས་བྱ་བ་འདི་ནི་མིང་ཙམ་མོ། །འདི་ལྟ་སྟེ། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ཞེས་བྱ་བ་འདི་ནི་མིང་ཙམ་མོ།
en: That is to say, this ‘buddha’ is a mere name, {Dt.39} this ‘perfection of wisdom’ is a mere name, this ‘practicing of the perfection of wisdom’ is a mere name, these ‘physical forms’ are a mere name, these ‘feelings, perceptions, formative predispositions, and consciousness’ are mere names.

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་བདག་བདག་ཅེས་བྱ་བ་ནི་ཐ་སྙད་དུ་བརྗོད་མོད་ཀྱི། དེ་ལ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་བརྟགས་ན་དམིགས་སུ་མེད་དོ།
en: For example, Śāradvatīputra, one conventionally speaks of a ‘self’ even though it is nonapprehensible when definitively investigated.

source: །སེམས་ཅན་སེམས་ཅན་ཞེས་བྱ་བ་ནི་ཐ་སྙད་དུ་བརྗོད་མོད་ཀྱི། དེ་ལ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་བརྟགས་ན་དམིགས་སུ་མེད་དོ།
en: One conventionally speaks of ‘beings’ even though they are nonapprehensible when definitively investigated.

source: །སྲོག་སྲོག་ཅེས་བྱ་བ་ནི་ཐ་སྙད་དུ་བརྗོད་མོད་ཀྱི། དེ་ལ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་བརྟགས་ན་མི་དམིགས་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་དམིགས་སུ་མེད་དོ།
en: One conventionally speaks of ‘life forms’ even though they are nonapprehensible when definitively investigated, owing to the emptiness of nonapprehensibility.

source: །དེ་བཞིན་དུ་འདི་ལྟ་སྟེ་དཔེར་ན། གསོ་བ་དང་སྐྱེས་བུ་དང་གང་ཟག་དང་ཤེད་ཅན་དང་ཤེད་བདག་དང་བྱེད་པ་པོ་དང་བྱེད་དུ་འཇུག་པ་པོ་དང་ཚོར་བ་པོ་དང་ཚོར་བར་བྱེད་པ་པོ་དང་སློང་བ་པོ་དང་ཀུན་དུ་སློང་བ་པོ་དང་ཤེས་པ་པོ་དང་མཐོང་བ་པོ་དང་རེག་པ་པོ་དང་། རྣམ་པར་ཤེས་པ་པོ་ཞེས་བྱ་བ་ནི་ཐ་སྙད་དུ་བརྗོད་མོད་ཀྱི། དེ་ལ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་བརྟགས་ན། མི་དམིགས་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་དམིགས་སུ་མེད་དེ།
en: Similarly, for example, one conventionally speaks of ‘life, living creatures, persons, human beings, people, actors, creators, experiencers, instigators of experience, petitioners, instigators, knowers, viewers, touchers, and conscious beings,’ even though they are nonapprehensible when definitively investigated, owing to the emptiness of nonapprehensibility.

source: མིང་དང་བརྡ་ཙམ་དུ་ཐ་སྙད་དུ་བརྗོད་དོ།
en: These are mere names and symbols, designated according to convention.

source: །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: In the same manner, when bodhisattva great beings practice the perfection of wisdom, they too do not observe a bodhisattva.

source: །བྱང་ཆུབ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe enlightenment.

source: །སངས་རྒྱས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe buddhas.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ་ཞེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe the perfection of wisdom.

source: །མིང་གང་གིས་ཐ་སྙད་དུ་བརྗོད་པའི་མིང་དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: Nor do they even observe those names that are designated according to convention.

source: དེ་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི། དེ་བཞིན་གཤེགས་པའི་ཤེས་རབ་མ་གཏོགས་པར་དེ་མ་ཡིན་པའི་ཤེས་རབ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཤེས་རབ་ཀྱི་བར་དུ་དམིགས་སུ་མེད་པའི་སྟོང་པ་ཉིད་ཉེ་བར་བཟུང་བས་ཟིལ་གྱིས་གནོན་ཏོ།
en: So it is that, owing to their apprehending of the emptiness of nonapprehensibility, bodhisattva great beings who practice the perfection of wisdom outshine the wisdom of all beings, up to and including the wisdom of the śrāvakas and pratyekabuddhas, except for the wisdom of the tathāgatas.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེས་གང་གིས་མངོན་པར་ཆགས་པར་འགྱུར་བ་དེ་ཡང་ཉེ་བར་མི་དམིགས་ཏེ།
en: If you ask why, it is because they do not even apprehend anything through which they might be attached.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ཡིན་ནོ། །ཤ་ར་དྭ་ཏིའི་བུ་གལ་ཏེ་འཛམ་བུའི་གླིང་འདི་དགེ་སློང་ཤ་ར་དྭ་ཏིའི་བུ་དང་། མཽད་གལ་གྱི་བུ་ལྟ་བུ་ཤ་སྟག་གིས་འདི་ལྟ་སྟེ་དཔེར་ན། འདམ་བུའི་ཚལ་ལམ། སྦའི་ཚལ་ལམ།
en: Śāradvatīputra, bodhisattva great beings who practice accordingly are practicing the perfection of wisdom. “

source: བུ་རམ་ཤིང་གི་ཚལ་ལམ། སྨྱིག་མའི་ཚལ་ལམ། འབྲས་ཀྱི་ཞིང་ངམ། ཏིལ་གྱི་ཞིང་ལྟར་ཡོངས་སུ་གང་བར་གྱུར་ཀྱང་། དེ་དག་གི་ཤེས་རབ་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཤེས་རབ་ཀྱི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ།
en: Śāradvatīputra, were this Jambudvīpa to be filled entirely with monks of the caliber of Śāradvatīputra and Maudgalyāyana, like a grove of reeds, like a grove of rattan, like a grove of sugarcane, like a thicket of bamboo, like a paddy field of rice, or like a field of sesame, their wisdom would not approach even a hundredth part of the wisdom of bodhisattva great beings who practice the perfection of wisdom.

source: སྟོང་གི་ཆ་དང་བརྒྱ་སྟོང་ནས་བྱེ་བ་བརྒྱ་སྟོང་གི་ཆ་དང་གྲངས་དང་ཆ་དང་བགྲང་བ་དང་དཔེ་དང་རྒྱུར་ཡང་མི་ཕོད་དོ།
en: It would not match even a thousandth part of it, or anything from a hundred thousandth to a thousand billionth part of it, in number, fraction, categorization, comparison, or quality.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤ་ར་དྭ་ཏི་བུ་དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ནི། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བའི་དོན་དུ་ཉེ་བར་གནས་པ་ཡིན་ཏེ།
en: If you ask why, Śāradvatīputra, it is because the wisdom of bodhisattva great beings is established so that all beings will pass into final nirvāṇa.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཤེས་རབ་ནི་དེ་ལྟ་མ་ཡིན་ནོ།
en: The wisdom of the śrāvakas and pratyekabuddhas is not so. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པས། ཉིན་གཅིག་ཏུ་ཡོངས་སུ་བསྒོམས་པའི་ཤེས་རབ་ཇི་ཙམ་པ་དེས་ཀྱང་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཤེས་རབ་ཟིལ་གྱིས་མནན་ཅིང་གནས་ཏེ། ཤ་ར་དྭ་ཏིའི་བུ་འཛམ་བུའི་གླིང་འདི་དགེ་སློང་ཤ་ར་དྭ་ཏིའི་བུ་དང་། མཽད་གལ་གྱི་བུ་ལྟ་བུ་ཤ་སྟག་གིས་ཡོངས་སུ་གང་བ་ལྟ་ཞོག་གི།
en: Moreover, Śāradvatīputra, bodhisattva great beings who practice the perfection of wisdom continue, even with as much wisdom as they cultivate in a single day, to outshine the wisdom of all śrāvakas and pratyekabuddhas.

source: ཤ་ར་དྭ་ཏིའི་བུ་གལ་ཏེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དགེ་སློང་ཁྱེད་འདྲ་བ་ཤ་སྟག་གིས་ཡོངས་སུ་གང་བར་གྱུར་ཀྱང་། དེ་དག་གིས་ཤེས་རབ་ཀྱིས་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཤེས་རབ་ཀྱི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ། སྟོང་གི་ཆ་དང་།
en: Śāradvatīputra, let alone it being just this Jambudvīpa that was filled entirely with monks of the caliber of Śāradvatīputra and Maudgalyāyana—instead were this whole great trichiliocosm to be filled entirely with monks such as you, Śāradvatīputra, their wisdom would not approach even a hundredth part of the wisdom of bodhisattva great beings who practice the perfection of wisdom.

source: བརྒྱ་ཕྲག་སྟོང་གི་ཆ་དང་བྱེ་བ་བརྒྱའི་ཆ་དང་བྱེ་བ་སྟོང་གི་ཆ་དང་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་གི་ཆ་དང་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱའི་ཆ་དང་བྱེ་བ་ཁྲག་ཁྲིག་སྟོང་གི་ཆ་དང་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་གི་ཆ་དང་། གྲངས་དང་། ཆ་དང་བགྲང་བ་དང་དཔེར་ཡང་ཉེ་བར་མི་འགྲོ་སྟེ། རྒྱུར་ཡང་མི་ཕོད་དོ། །ཤ་ར་དྭ་ཏིའི་བུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ལྟ་ཞོག་གི། ཤ་ར་དྭ་ཏིའི་བུ་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཅིག་དགེ་སློང་ཤ་ར་དྭ་ཏིའི་བུ་དང་། མཽད་གལ་གྱི་བུ་ལྟ་བུ་ཤ་སྟག་གིས་ཡོངས་སུ་གང་བར་གྱུར་པ་དང་།
en: It would not approach even a thousandth, a hundred thousandth, a hundred million trillionth, a billion trillionth, or a hundred billion trillionth part of it, in number, fraction, categorization, or comparison; nor would they match it in quality.

source: ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་དང་། འོག་དང་སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཅིག །དགེ་སློང་ཤ་ར་དྭ་ཏིའི་བུ་དང་། མཽད་གལ་གྱི་བུ་ལྟ་བུ་ཤ་སྟག་གིས་ཡོངས་སུ་གང་བར་གྱུར་ཀྱང་། དེ་དག་གི་ཤེས་རབ་ཀྱིས་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཤེས་རབ་ཉིན་གཅིག་ཏུ་བསྒོམས་པའི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: Śāradvatīputra, let alone it being just this great trichiliocosm—instead, Śāradvatīputra, were all the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, to be filled entirely with monks of the caliber of Śāradvatīputra and Maudgalyāyana, and were the world systems of each of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, along with the directions of the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, all to be filled entirely with monks of the caliber of Śāradvatīputra and Maudgalyāyana, their wisdom would not approach even a hundredth part of the wisdom that bodhisattva great beings who practice the perfection of wisdom have cultivated in a single day.

source: །སྟོང་གི་ཆ་དང་བརྒྱ་སྟོང་གི་ཆ་དང་བྱེ་བ་བརྒྱ་སྟོང་གི་ཆ་དང་། བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་གི་ཆ་དང་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱའི་ཆ་དང་བྱེ་བ་ཁྲག་ཁྲིག་སྟོང་གི་ཆ་དང་། བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་གི་ཆ་དང་། གྲངས་དང་ཆ་དང་བགྲང་བ་དང་དཔེར་ཡང་ཉེ་བར་མི་འགྲོ་སྟེ་རྒྱུར་ཡང་མི་ཕོད་དོ། །ཤ་ར་དྭ་ཏིའི་བུས་གསོལ་པ།
en: It would not approach even a thousandth, a hundred thousandth, a hundred million trillionth, a billion trillionth, or a hundred billion trillionth part of it, in number, fraction, categorization, or comparison; nor would they match it in quality.” {

source: བཅོམ་ལྡན་འདས་གང་འདི་ཉན་ཐོས་རྒྱུན་དུ་ཞུགས་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པའི་ཤེས་རབ་དང་། གང་ཡང་རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཤེས་རབ་དང་། ཤེས་རབ་དེ་དག་ཐམས་ཅད་ཐ་མི་དད་པ་སྟེ།
en: Dt.40} Śāradvatīputra then said, “Blessed Lord, the wisdom of the śrāvakas who enter the stream to nirvāṇa, who are destined for only one more rebirth, who will no longer be subject to rebirth, and who are arhats, and also the wisdom of those who are pratyekabuddhas, bodhisattvas, and tathāgatas, arhats, completely awakened buddhas—none of those wisdoms can be differentiated.

source: དབྱེར་མ་མཆིས། སྟོང་པ་དབེན་པ་རང་བཞིན་གྱིས་མ་བྱུང་བ་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པ་སྟེ། བཅོམ་ལྡན་འདས་དབྱེར་མ་མཆིས་ཤིང་། དབེན་ལ་མ་སྐྱེས་པ་དང་།
en: They are indivisible, empty, void, intrinsically nonarising, and empty of essential nature.

source: རང་བཞིན་གྱིས་སྟོང་པ་ལ་ནི་ཁྱད་པར་རམ་བྱེ་བྲག་ཏུ་བགྱི་བ་མི་དམིགས་ན། བཅོམ་ལྡན་འདས་དེ་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པས། གདུགས་གཅིག་ཏུ་བསྒོམས་པའི་ཤེས་རབ་ཀྱིས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཤེས་རབ་ཟིལ་གྱིས་གནོན་པར་འགྱུར་བ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་དེ་ཇི་སྙམ་དུ་སེམས།
en: Blessed Lord, if no differences or distinctions can be apprehended in that which is indivisible, void, nonarising, and empty of inherent existence, how then, Blessed Lord, does the wisdom cultivated in a single session by bodhisattva great beings who practice the perfection of wisdom outshine the wisdom of all the śrāvakas and pratyekabuddhas?” “

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཤེས་རབ་ཉིན་གཅིག་ཏུ་བསྒོམས་པས། བདག་གིས་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ལ་སྤྱད་དེ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་བྱས་ལ་ཆོས་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་མངོན་པར་སངས་རྒྱས་པར་བྱས་ཏེ། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མྱ་ངན་ལས་བཟླའོ་ཞེས་དོན་གང་གི་ཕྱིར་སྟ་གོན་དུ་གནས་པ་དེ་ལྟ་བུའི་དོན་དུ། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཤེས་རབ་སྟ་གོན་དུ་གནས་སམ།
en: Śāradvatīputra,” replied the Blessed One, “do you think that the purpose for which the wisdom of all the śrāvakas and pratyekabuddhas is established is comparable to the purpose for which the wisdom cultivated in a single day by bodhisattva great beings who practice the perfection of wisdom is established as they think, ‘Having practiced knowledge of the path, having acted for the sake of all beings, when I attain consummate buddhahood in all its aspects with respect to all phenomena I shall bring all beings to attain final nirvāṇa’?” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ལྟ་མ་ལགས་སོ།
en: No, Blessed Lord!”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: he replied.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། ཇི་ག་ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་འདི་སྙམ་དུ་བདག་ཅག་གིས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་བྱས་ཏེ། སེམས་ཅན་ཐམས་ཅད་ཕུང་པོ་མ་ལུས་པར་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་བཟླའོ་སྙམ་དུ་སེམས་སམ།
en: The Blessed One then asked, “Śāradvatīputra, do you think that there are any śrāvakas or pratyekabuddhas who consider, ‘Once we have attained consummate buddhahood in unsurpassed, complete enlightenment, we should bring all beings into the expanse beyond sorrow with no residual aggregates to attain final nirvāṇa’?” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ལྟར་སེམས་པ་མ་མཆིས་སོ།
en: No, Blessed Lord, I do not think so!”

source: དེ་ལྟར་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་འདིས་ཀྱང་དེ་ལྟར་ཁོང་དུ་ཆུད་པར་བྱ་སྟེ། གང་འདི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཤེས་རབ་དང་། གང་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ལས་ཤེས་རབ་འདི་ཉེ་བར་བཟུང་ན། གང་འདི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཤེས་རབ་ཀྱིས་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: The Blessed One then said, “For this reason, Śāradvatīputra, you should understand that, between the wisdom of all śrāvakas and pratyekabuddhas and the wisdom of bodhisattva great beings, when one apprehends the latter wisdom, the wisdom of all śrāvakas and pratyekabuddhas cannot approach even a hundredth part of it.

source: །སྟོང་གི་ཆ་དང་བརྒྱ་ཕྲག་སྟོང་གི་ཆ་དང་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱའི་ཆ་དང་བྱེ་བ་ཁྲག་ཁྲིག་སྟོང་གི་ཆ་དང་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་གི་ཆ་དང་གྲངས་དང་ཆ་དང་བགྲང་བ་དང་དཔེར་ཡང་ཉེ་བར་མི་འགྲོ་སྟེ་རྒྱུར་ཡང་མི་ཕོད་དོ། །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། ཇི་ག་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་འདི་སྙམ་དུ་བདག་ཅག་གིས་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་དེ། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱས་ལ། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱས་ཏེ། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ཡོངས་སུ་རྫོགས་པར་བྱས་ལ། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་།
en: It cannot approach even a thousandth, a hundred thousandth, a hundred million trillionth, a billion trillionth, or a hundred billion trillionth part of it, in number, fraction, categorization, or comparison; nor can it match it in quality. “

source: བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཡོངས་སུ་རྫོགས་པར་བྱས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པ་ཡོངས་སུ་མྱ་ངན་ལས་བཟླའོ་སྙམ་དུ་སེམས་སམ།
en: Śāradvatīputra, do you think that there are any śrāvakas or pratyekabuddhas who consider, ‘Once I have practiced the six perfections, brought beings to maturation, refined the buddhafields, perfected the ten powers of the tathāgatas, and perfected the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas, {Dt.41} I will attain consummate buddhahood in unsurpassed, complete enlightenment, and then bring immeasurable, countless beings to attain final nirvāṇa’?” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ལྟར་སེམས་པ་མ་མཆིས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་གིས་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་དེ། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱས་ལ། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱས་ཏེ། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ཡོངས་སུ་རྫོགས་པར་བྱས་ལ།
en: No, Blessed Lord, I do not think so!”

source: མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་།
en: he replied.

source: བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཡོངས་སུ་རྫོགས་པར་བྱས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པ་ཡོངས་སུ་མྱ་ངན་ལས་བཟླའོ་སྙམ་དུ་སེམས་སོ།
en: The Blessed One then said, “Śāradvatīputra, bodhisattva great beings do have the following thought: ‘Once I have practiced the six perfections, brought beings to maturation, refined the buddhafields, perfected the ten powers of the tathāgatas, and perfected the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas, I will attain consummate buddhahood in unsurpassed, complete enlightenment, and then enable immeasurable, countless beings to attain final nirvāṇa.’

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། སྲོག་ཆགས་ཀྱི་རིགས་མེ་ཁྱེར་ནི་འདི་ལྟར་བདག་གི་སྣང་བས་འཛམ་བུའི་གླིང་ཀུན་དུ་སྣང་བར་བྱའོ། །བདག་གི་འོད་ཀྱིས་འཛམ་བུའི་གླིང་རྒྱས་པར་དགང་བར་བྱའོ་སྙམ་དུ་མི་སེམས་སོ། །ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱང་། འདི་ལྟར་བདག་ཅག་གིས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་དེ། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱས་ལ།
en: Śāradvatīputra, just as a firefly, which is a species of insect, does not think, ‘May my light illuminate all Jambudvīpa!

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱས་ཏེ། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ཡོངས་སུ་རྫོགས་པར་བྱས་ལ། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་།
en: May my light extensively fill Jambudvīpa!’

source: བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཡོངས་སུ་རྫོགས་པར་བྱས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པ་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བར་བྱའོ་སྙམ་དུ་མི་སེམས་སོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་བཞི་པ། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། ཉི་མའི་དཀྱིལ་འཁོར་འཆར་བ་ནི་འཛམ་བུའི་གླིང་ཐམས་ཅད་སྣང་བས་རྒྱས་པར་བྱེད་དོ། །འཛམ་བུའི་གླིང་ཐམས་ཅད་སྣང་བས་གསལ་བར་
en: in the same way, Śāradvatīputra, there are no śrāvakas or pratyekabuddhas at all who think, ‘Once I have practiced the six perfections, brought beings to maturation, refined the buddhafields, perfected the ten powers of the tathāgatas, and perfected the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas, I will attain consummate buddhahood in unsurpassed, complete enlightenment, and then bring immeasurable, countless beings to attain final nirvāṇa.’ “

source: བྱེད་དོ། །ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པ་ཡང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱས་ཤིང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱས་ནས། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ཡོངས་སུ་རྫོགས་པར་བྱས་ཏེ། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཡོངས་སུ་རྫོགས་པར་བྱས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པ་ཡོངས་སུ་མྱ་ངན་ལས་བཟླའོ། །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: Śāradvatīputra, just as the rising sun suffuses the entirety of Jambudvīpa with its light and illuminates the entirety of Jambudvīpa with its light, in the same way, Śāradvatīputra, bodhisattva great beings who have practiced the perfection of wisdom have also brought beings to maturation, refined the buddhafields, perfected the ten powers of the tathāgatas, and perfected the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas, and they will attain consummate buddhahood in unsurpassed, complete enlightenment, and then bring immeasurable, countless beings to attain final nirvāṇa.”

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱིས་ལས་འདས་ཤིང་། ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའི་ས་འཐོབ་པ་དང་། བྱང་ཆུབ་ཀྱི་ལམ་ཡོངས་སུ་སྦྱོང་བ་ལགས།
en: The venerable Śāradvatīputra then asked the Blessed One, “Blessed Lord, how do bodhisattva great beings transcend the levels of the śrāvakas and pratyekabuddhas, attain the level of an irreversible bodhisattva, and refine the path of enlightenment?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སེམས་དང་པོ་བསྐྱེད་པ་ཉེ་བར་བཟུང་ནས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། སྟོང་པ་ཉིད་དང་། མཚན་མ་མྱེད་པ་དང་།
en: The Blessed One replied to Śāradvatīputra, “Śāradvatīputra, in this regard, when bodhisattva great beings, starting from the time when they first begin to set their mind on enlightenment, practice the six perfections, they dwell in emptiness, signlessness, and wishlessness.

source: སྨོན་པ་མེད་པའི་ཆོས་ལ་གནས་ཏེ། ཐབས་མཁས་པས། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱིས་ལས་འདས་ནས། ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའི་ས་འཐོབ་སྟེ།
en: Through skillful means they will transcend the levels of the śrāvakas and pratyekabuddhas, and then attain the level of an irreversible bodhisattva.

source: བྱང་ཆུབ་ཀྱི་ལམ་ཡང་སྤྱོད་དོ།
en: They will also refine the path of enlightenment.”

source: །ཤ་ར་དྭ་ཏིའི་བུས་གསོལ་པ། བཅོམ་ལྡན་འདས་ས་གང་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྦྱིན་པའི་གནས་སུ་འགྱུར་བ་ལགས།
en: Śāradvatīputra then asked, “Blessed Lord, abiding on what level are bodhisattva great beings worthy of receiving the donations of all śrāvakas and pratyekabuddhas?” {

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་ཐོག་མ་སེམས་བསྐྱེད་ཕྱིན་ཆད། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པ་ནི། སྙིང་པོ་བྱང་ཆུབ་ལ་འདུག་གི་བར་དུ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྦྱིན་པའི་གནས་སུ་གྱུར་པ་ཡིན་ནོ།
en: Dt.42} “Śāradvatīputra,” replied the Blessed One, “bodhisattva great beings who practice the six perfections from the time when they first set their minds on enlightenment until they are seated at the site of enlightenment are worthy recipients of the offerings of all śrāvakas and pratyekabuddhas.
